app/controllers/books_controller.rb

INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "0pli3"], ["body", "u3kx00c2ojiq2o9wn0cy"], ["created_at", "2021-03-03 08:47:37.652810"], ["updated_at", "2021-03-03 08:47:37.652810"]]
SELECT "books".* FROM "books"
---
  def create
    @book = Book.new(book_params)
    if @book.save
      flash[:notice] = "successfully"
      redirect_to book_path(@book.id )
    else
      @books = Book.all

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "i1410"], ["body", "jw3p9yd9o02ass1hh0g6"], ["updated_at", "2021-03-03 08:58:11.601128"], ["id", 1]]
---
  def update
       book = Book.find(params[:id])
    if book.update(book_params)